using System;
using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace ApplicationContext.Migrations
{
    /// <inheritdoc />
    public partial class seedQuestion : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.UpdateData(
                table: "Attempts",
                keyColumn: "Id",
                keyValue: new Guid("9b8daa9f-7f8c-41d9-aa34-ba2b1010f4ed"),
                columns: new[] { "CreatedDate", "ExamDate" },
                values: new object[] { new DateTime(2023, 11, 19, 13, 32, 37, 892, DateTimeKind.Utc).AddTicks(231), new DateTime(2023, 11, 20, 13, 32, 37, 892, DateTimeKind.Utc).AddTicks(235) });

            migrationBuilder.InsertData(
                table: "MBTI_Questions",
                columns: new[] { "Id", "Category", "CreatedBy", "FirstAnswerType", "NameAns1", "NameAns2", "NameQuestion", "SecondAnswerType" },
                values: new object[,]
                {
                    { 1, 0, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 0, "a. Xã hội, giao tiếp.", "b. Thiết kế, nghiên cứu.", "Bạn thích công việc kiểu : ", 1 },
                    { 2, 0, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 0, "a. Khách quan.", "b. Chủ quan.", "Bạn tiếp xúc với một người theo xu hướng : ", 1 },
                    { 3, 2, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 4, "a. Ý nghĩa, giá trị.", "b. Tính logic.", "Bạn đánh giá sự việc dựa trên : ", 5 },
                    { 4, 0, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 0, "a. Thong thả, thoải mái.", "b. Nhanh nhẹn, đúng giờ.", "Bạn là người có tác phong : ", 1 },
                    { 5, 0, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 0, "a. Bắt đầu cho cuộc nói chuyện.", "b. Chỉ nói khi người khác bắt chuyện.", "Trong các cuộc giao tiếp, bạn là người : ", 1 },
                    { 6, 2, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 4, "a. Là người có cái đầu lạnh.", "b. Là người có trái tim ấm.", "Bạn là người thế nào : ", 5 },
                    { 7, 0, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 0, "a. Dễ chịu, thoải mái.", "b. Nghiêm chỉnh, quả quyết.", "Tính cách của bạn : ", 1 },
                    { 8, 3, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 6, "a. Khá thú vị.", "b. Khó hiểu.", "Những người có tầm nhìn xa thường : ", 7 },
                    { 9, 0, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 0, "a. Dễ dàng bắt chuyện và trò chuyện nhiều điều cùng họ.", "b. Cảm thấy khó khăn và không biết nên nói gì.", "Đối với những người mới gặp, bạn thường : ", 1 },
                    { 10, 3, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 6, "a. Không có quy trình cụ thể.", "b. Thiếu tính sáng tạo.", "Một công việc gây nhàm chán khi : ", 7 },
                    { 11, 2, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 4, "a. Sự hòa hợp với mọi người.", "b. Sự nhất quán trong suy nghĩ.", "Bạn bị hấp dẫn bởi : ", 5 },
                    { 12, 1, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 2, "a. Giàu trí tưởng tượng.", "b. Nắm bắt tình huống tốt.", "Bạn bị lôi cuốn bởi kiểu người : ", 3 },
                    { 13, 0, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 0, "a. Dè dặt.", "b. Thoải mái.", "Trong các cuộc trò chuyện bạn thường : ", 1 },
                    { 14, 2, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 4, "a. Tuân theo chuẩn mực.", "b. Đôi lúc không hiểu rõ nguyên nhân.", "Lựa chọn của bạn có xu hướng : ", 5 },
                    { 15, 2, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 4, "a. Không công bằng.", "b. Tàn nhẫn.", "Trong hai điều sau, điều nào tồi tệ hơn : ", 5 },
                    { 16, 2, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 4, "a. Kiên quyết.", "b. Nhẹ nhàng.", "Tính cách nào giống bạn hơn : ", 5 },
                    { 17, 0, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 0, "a. Độc lập giải quyết.", "b. Trao đổi với mọi người.", "Đối với một vấn đề trong nhóm : ", 1 },
                    { 18, 3, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 6, "a. Những điều bất ngờ không tính trước.", "b. Những điều có kế hoạch trước.", "Trong cuộc sống, bạn cảm thấy hứng thú với : ", 7 },
                    { 19, 2, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 4, "a. Chắc chắn trong tư tưởng.", "b. Cống hiến hết mình.", "Bạn thấy tâm đắc với bản thân bởi sự : ", 5 },
                    { 20, 2, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 4, "a. Khả năng lý luận phân tích.", "b. Sự liên tưởng.", "Bạn nhìn nhận một vấn đề với : ", 5 },
                    { 21, 0, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 0, "a. Ở nhà cùng gia đình.", "b. Đi du lịch cùng bạn bè.", "Trong các kỳ nghỉ lễ bạn có xu hướng : ", 1 },
                    { 22, 3, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 6, "a. Các ngụ ý, hàm ý, ẩn ý.", "b. Các nguyên tắc, nguyên lý.", "Bạn bị lôi cuốn bởi : ", 7 },
                    { 23, 2, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 5, "a. Cảm nhận từ con tim.", "b. Những quy tắc chung.", "Khi quyết định việc gì bạn thường dựa vào : ", 4 },
                    { 24, 3, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 6, "a. Làm việc có phương pháp, tổ chức tốt.", "b. Ứng biến xoay trở tốt trước khó khăn.", "Bạn thích làm việc với người Sếp", 7 },
                    { 25, 3, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 6, "a. Sự chắc chắn.", "b. Sự cởi mở.", "Bạn nghiêng về :", 7 },
                    { 26, 2, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 4, "a. Công tư phân minh.", "b. Bị tình cảm chi phối.", "Bạn là người có tư tưởng :", 5 },
                    { 27, 1, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 3, "a. Nghệ thuật.", "b. Khoa học.", "Bạn thích học các môn :", 2 },
                    { 28, 0, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 1, "a. Trầm lặng, ít nói.", "b. Hoạt bát, vui vẻ.", "Trong một nhóm bạn bè bạn thường :", 0 },
                    { 29, 1, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 2, "a. Dựa vào vẻ ngoài của họ.", "b. Dựa vào cảm nhận của bạn.", "Khi đánh giá một người bạn thường :", 3 },
                    { 30, 3, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 6, "a. Quá nồng nhiệt, mong chờ.", "b. Quá khách quan.", "Sẽ thật tai hại khi bạn :", 7 },
                    { 31, 1, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 2, "a. Thích những thứ quen thuộc.", "b. Thích những điều mới mẻ.", "Phong cách của bạn :", 3 },
                    { 32, 3, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 7, "a. Tìm kiếm một cách làm mới.", "b. Làm theo cách mọi người hay làm.", "Khi giải quyết một công việc thông thường, bạn sẽ :", 6 },
                    { 33, 0, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 1, "a. Độc lập.", "b. Theo nhóm.", "Bạn thích làm việc :", 0 },
                    { 34, 3, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 6, "a. Hiếm khi.", "b. Hay xảy ra.", "Bạn có hành động theo bản năng :", 7 },
                    { 35, 2, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 4, "a. Giàu lý trí.", "b. Giàu cảm xúc.", "Trong cuộc sống, một người sẽ tốt hơn nếu :", 5 },
                    { 36, 3, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 6, "a. Theo thứ tự.", "b. Phát ngẫu nhiên.", "Khi nghe một album nhạc mới, bạn thường nghe :", 7 },
                    { 37, 2, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 5, "a. Khéo léo, lanh lợi.", "b. Thẳng thắn, thực tế.", "Bạn là người :", 4 },
                    { 38, 2, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 4, "a. Sử dụng người khác.", "b. Hiểu và chia sẻ với người khác.", "Sẽ khó khăn hơn khi bạn cố:", 5 },
                    { 39, 0, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 1, "a. Diễn đạt trực tiếp nhất có thể.", "b. Diễn đạt một cách gián tiếp.", "Khi trình bày bạn thường :", 0 },
                    { 40, 0, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 0, "a. Tìm bạn bè tâm sự hoặc đi chơi.", "b. Muốn ở một mình cho khuây khỏa.", "Khi cảm thấy buồn bạn thường :", 1 },
                    { 41, 3, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 6, "a. Tham gia khi bị ép.", "b. Năng nổ, tích cực.", "Đối với các hoạt động của cơ quan, lớp học :", 7 },
                    { 42, 1, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 3, "a. Những thứ không xác định.", "b. Những thứ có logic.", "Bạn cảm thấy thoải mái với :", 2 },
                    { 43, 2, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 5, "a. Dễ dàng nắm bắt.", "b. Giấu kín, khó nhận biết.", "Cảm xúc của bạn thường được người khác :", 4 },
                    { 44, 2, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 4, "a. Hành xử thiếu cân nhắc.", "b. Chỉ trích, phê phán người khác.", "Thật tồi tệ khi :", 5 },
                    { 45, 3, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 6, "a. Chuẩn bị chu toàn trước.", "b. Diễn ra tự nhiên.", "Bạn muốn một sự kiện như thế nào :", 7 },
                    { 46, 0, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 0, "a. Dễ gần, hòa đồng.", "b. Thân thiện nhưng kín đáo.", "Bạn là người có tình cách :", 1 },
                    { 47, 1, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 3, "a. Trí tưởng tượng phong phú.", "b. Sự quan sát thực tế.", "Bạn có ưu điểm về :", 2 },
                    { 48, 2, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 5, "a. Linh cảm.", "b. Sự việc thực tế.", "Khi quyết định điều gì đó, bạn tin vào :", 4 },
                    { 49, 2, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 4, "a. Bạn là người có đầu óc suy luận.", "b. Bạn là người giàu tình cảm và sự tinh tế.", "Bạn muốn được người khác khen ngợi như thế nào :", 5 },
                    { 50, 3, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 6, "a. Có chọn lựa và suy tính.", "b. Một cách tự nhiên.", "Bạn thích các sự việc xảy ra :", 7 },
                    { 51, 3, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 7, "a. Bộc phát, linh hoạt.", "b. Kỹ lưỡng, cẩn thận.", "Bạn hay hành động một cách :", 6 },
                    { 52, 2, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 5, "a. Tình cảm dồi dào.", "b. Lý trí mạnh mẽ.", "Bạn muốn bổ sung thêm điều gì ở bản thân :", 4 },
                    { 53, 1, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 3, "a. Mơ mộng và tưởng tượng.", "b. Thực tế và thực dụng.", "Bạn là người :", 2 },
                    { 54, 0, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 0, "a. Nhấc máy trước để nghe.", "b. Để cho đồng nghiệp nhấc máy.", "Khi điện thoại bàn trong văn phòng công ty đổ chuông :", 1 },
                    { 55, 0, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 0, "a. Cố làm quen với nhiều người.", "b. Chỉ nói chuyện với vài người.", "Bạn mới tham gia một lớp Ngoại ngữ :", 1 },
                    { 56, 1, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 2, "a. Bản thân nó giải thích cho chính nó.", "b. Là bằng chứng giải thích cho các quy tắc, quy luật.", "Theo bạn, các sự việc, sự kiện :", 3 },
                    { 57, 2, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 5, "a. Đa sầu đa cảm.", "b. Thực dụng, không bị chi phối bởi tình cảm.", "Bạn là người :", 4 },
                    { 58, 2, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 5, "a. Những suy nghĩ của họ.", "b. Những gì họ làm được.", "Bạn thường quan tâm tới người khác thông qua :", 4 },
                    { 59, 3, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 6, "a. Thói quen.", "b. Những điều mới mẻ.", "Bạn nghiêng về điều nào sau đây :", 7 },
                    { 60, 3, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 6, "a. Luôn được chuẩn bị kỹ lưỡng.", "b. Tùy cơ ứng biến.", "Mọi việc sẽ tốt hơn nếu :", 7 },
                    { 61, 0, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 1, "a. Ít bạn nhưng chơi rất thân.", "b. Nhiều bạn nhưng không thân thiết lắm.", "Bạn thích mối quan hệ :", 0 },
                    { 62, 1, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 3, "a. Diễn đạt lời văn qua các phép so sánh, ẩn dụ.", "b. Nghĩ sao viết vậy, diễn đạt rõ ràng.", "Nếu bạn là nhà văn, bạn sẽ viết bài theo cách :", 2 },
                    { 63, 3, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 7, "a. Phụ thuộc vào tâm trạng.", "b. Suy tính cẩn trọng.", "Khi quyết định một việc :", 6 },
                    { 64, 3, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 6, "a. Một cách chắn chắn.", "b. Không chắc lắm, có thể thay đổi sau.", "Bạn thường hay đưa ra quyết định :", 7 },
                    { 65, 2, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 4, "a. Nguyên tắc, lý trí.", "b. Cảm xúc, tình cảm.", "Bạn là người sống thiên về :", 5 },
                    { 66, 1, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 2, "a. Thực tế.", "b. Bất ngờ, mới mẻ", "Bạn thích thú với sự việc :", 3 },
                    { 67, 1, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 2, "a. Không hứng thú.", "b. Hào hứng.", "Khi nói về một chủ đề mới lạ chưa gặp, bạn cảm thấy :", 3 },
                    { 68, 3, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 6, "a. Kiểm tra lại trước khi áp dụng.", "b. Tin tưởng và áp dụng theo.", "Đối với một suy luận được nhiều người tin dùng, bạn sẽ :", 7 },
                    { 69, 2, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 4, "a. Những thứ có tính logic cao.", "b. Những thứ gây cảm động.", "Điều gì làm cho bạn ấn tượng :", 5 },
                    { 70, 1, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 2, "a. Những thứ thực tế và rõ ràng.", "b. Những suy đoán.", "Bạn là người có xu hướng thiên về :", 3 },
                    { 71, 0, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 1, "a. Không thoải mái.", "b. Thích thú.", "Ở một nơi đông người làm bạn :", 0 },
                    { 72, 2, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 5, "a. Hoàn cảnh nhất định.", "b. Nguyên tắc chung.", "Bạn đánh giá một người dựa trên :", 4 },
                    { 73, 0, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 1, "a. Ra về sớm vì không hào hứng lắm.", "b. Vui chơi hết mình cho đến khi tàn tiệc.", "Bạn được mời tới bữa tiệc của công ty :", 0 },
                    { 74, 3, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 6, "a. Tuân thủ thời gian.", "b. Làm việc tùy hứng.", "Khi làm việc bạn sẽ :", 7 },
                    { 75, 0, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 0, "a. Trò chuyện cùng nhiều người, quen hoặc không quen.", "b. Chỉ trò chuyện với một số người quen.", "Khi đi tham dự một buổi liên hoan/tiệc tùng, bạn sẽ :", 1 },
                    { 76, 1, new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"), 3, "a. Những thứ mơ hồ, không rõ ràng.", "b. Những thứ nhàm chán, tẻ nhạt.", "Điều gì làm bạn cảm thấy tồi tệ :", 2 }
                });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("09d2d924-8c18-4e49-bbc4-f67c0204d7af"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 86, 72, 164, 70, 155, 251, 105, 175, 157, 138, 156, 61, 204, 12, 129, 214, 80, 31, 165, 159, 207, 199, 93, 234, 62, 98, 233, 104, 201, 61, 156, 24, 54, 82, 180, 55, 77, 96, 122, 151, 81, 78, 222, 136, 74, 177, 64, 173, 205, 72, 69, 64, 72, 95, 133, 216, 109, 57, 47, 238, 16, 30, 183, 203 }, new byte[] { 171, 14, 167, 83, 82, 11, 207, 63, 188, 78, 239, 22, 120, 213, 28, 208, 121, 118, 144, 178, 117, 133, 142, 39, 178, 108, 219, 190, 250, 80, 19, 24, 187, 66, 79, 212, 156, 138, 3, 117, 188, 234, 111, 62, 206, 103, 23, 33, 112, 96, 1, 248, 134, 253, 122, 255, 200, 162, 222, 38, 136, 106, 3, 7, 255, 208, 175, 191, 9, 85, 19, 233, 38, 123, 162, 201, 104, 33, 198, 148, 94, 74, 64, 223, 112, 55, 169, 162, 216, 21, 99, 81, 194, 66, 212, 68, 123, 115, 240, 17, 193, 43, 54, 172, 3, 183, 110, 159, 161, 79, 253, 9, 127, 26, 64, 61, 144, 143, 159, 195, 237, 96, 39, 88, 168, 233, 112, 44 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("1a022b66-8b1c-461a-be8a-ec2a7b0741e9"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 231, 2, 236, 18, 76, 183, 49, 42, 146, 145, 35, 157, 133, 27, 36, 229, 105, 204, 108, 89, 46, 74, 221, 71, 147, 62, 40, 230, 12, 189, 152, 186, 247, 6, 54, 22, 66, 44, 125, 224, 194, 58, 65, 181, 213, 235, 244, 185, 205, 45, 158, 35, 179, 233, 242, 146, 230, 176, 64, 239, 232, 142, 183, 83 }, new byte[] { 239, 208, 239, 65, 89, 14, 198, 44, 58, 140, 94, 116, 27, 157, 203, 124, 7, 175, 186, 139, 244, 251, 39, 70, 149, 161, 84, 64, 120, 123, 63, 168, 233, 168, 106, 206, 151, 98, 250, 141, 212, 125, 234, 106, 209, 61, 146, 87, 111, 48, 234, 77, 157, 73, 214, 87, 179, 25, 150, 110, 92, 224, 60, 134, 35, 215, 238, 0, 223, 20, 159, 87, 246, 221, 120, 138, 118, 220, 6, 246, 8, 132, 65, 144, 36, 168, 93, 235, 193, 46, 198, 250, 169, 42, 153, 104, 44, 12, 44, 233, 175, 109, 44, 125, 32, 11, 188, 36, 190, 123, 80, 58, 52, 63, 60, 102, 184, 156, 20, 72, 35, 0, 153, 117, 175, 254, 33, 59 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("1eff27be-f2ea-4df7-93a5-33c7ba5e2d98"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 45, 82, 187, 108, 43, 195, 200, 49, 177, 4, 161, 9, 98, 93, 131, 134, 66, 77, 243, 71, 0, 210, 24, 189, 157, 39, 21, 199, 154, 215, 12, 242, 190, 12, 149, 198, 156, 214, 205, 226, 181, 114, 113, 69, 137, 82, 112, 103, 18, 43, 19, 194, 60, 55, 213, 194, 240, 255, 92, 188, 132, 64, 136, 193 }, new byte[] { 113, 30, 36, 230, 63, 119, 254, 30, 37, 47, 230, 95, 238, 115, 115, 181, 165, 69, 194, 136, 137, 68, 178, 195, 208, 19, 217, 157, 198, 69, 17, 61, 91, 36, 210, 64, 187, 180, 60, 206, 105, 234, 104, 58, 23, 66, 83, 235, 219, 210, 19, 71, 51, 5, 91, 92, 28, 37, 233, 142, 194, 19, 249, 121, 139, 55, 177, 158, 238, 144, 165, 68, 164, 220, 35, 167, 77, 174, 4, 99, 113, 110, 72, 187, 75, 198, 213, 0, 82, 177, 134, 203, 156, 167, 80, 134, 155, 110, 198, 251, 16, 189, 89, 210, 146, 15, 251, 170, 84, 47, 174, 217, 43, 7, 91, 103, 73, 223, 227, 36, 170, 2, 236, 216, 27, 100, 50, 181 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("24d15338-310e-4d3d-9e39-86444fc0ddec"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 34, 212, 37, 201, 172, 118, 122, 177, 172, 13, 32, 153, 220, 229, 198, 251, 34, 7, 254, 194, 56, 20, 21, 41, 36, 240, 210, 13, 234, 82, 175, 73, 177, 209, 26, 199, 194, 200, 87, 6, 17, 114, 52, 117, 156, 72, 118, 73, 205, 97, 235, 111, 117, 141, 125, 251, 70, 54, 152, 166, 26, 36, 19, 140 }, new byte[] { 81, 119, 167, 139, 71, 63, 186, 86, 39, 204, 182, 209, 133, 8, 246, 196, 60, 77, 210, 118, 173, 214, 185, 179, 138, 238, 23, 48, 49, 216, 112, 73, 250, 153, 8, 188, 46, 68, 41, 190, 211, 12, 235, 149, 70, 17, 89, 22, 170, 242, 145, 189, 4, 3, 232, 22, 22, 242, 200, 17, 253, 132, 217, 102, 231, 114, 124, 102, 148, 19, 155, 68, 43, 125, 47, 146, 52, 116, 127, 91, 128, 183, 160, 245, 201, 152, 197, 139, 202, 161, 220, 124, 223, 206, 8, 242, 85, 182, 69, 206, 243, 44, 168, 164, 79, 54, 124, 14, 180, 202, 125, 158, 147, 84, 169, 168, 126, 190, 18, 176, 90, 69, 65, 147, 95, 119, 81, 200 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("312f4251-1f9f-4f80-b2ad-968fc339b134"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 157, 172, 227, 9, 129, 88, 164, 50, 101, 16, 225, 54, 83, 138, 145, 1, 195, 144, 208, 175, 86, 160, 198, 152, 210, 79, 151, 177, 137, 148, 169, 107, 79, 108, 85, 12, 158, 100, 120, 63, 70, 146, 199, 26, 250, 251, 43, 38, 227, 52, 83, 114, 206, 7, 35, 248, 172, 21, 166, 66, 77, 79, 126, 87 }, new byte[] { 134, 58, 211, 227, 122, 136, 113, 114, 113, 194, 148, 186, 43, 21, 92, 247, 110, 117, 28, 68, 249, 246, 25, 169, 59, 147, 197, 85, 4, 105, 10, 64, 145, 174, 65, 213, 107, 100, 125, 213, 108, 127, 154, 97, 236, 42, 255, 57, 252, 23, 108, 136, 105, 172, 112, 124, 251, 140, 118, 22, 58, 214, 114, 122, 80, 224, 127, 247, 26, 22, 230, 31, 179, 158, 26, 178, 22, 95, 47, 112, 2, 180, 138, 58, 28, 149, 39, 202, 52, 135, 78, 211, 108, 238, 60, 173, 223, 129, 3, 184, 54, 85, 102, 142, 191, 245, 130, 123, 18, 49, 36, 85, 200, 214, 68, 17, 120, 197, 54, 137, 175, 75, 143, 237, 116, 46, 175, 231 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("324ed66e-e8de-4710-a139-18c50b442945"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 149, 47, 168, 79, 41, 171, 178, 126, 229, 254, 44, 207, 251, 95, 235, 180, 172, 217, 240, 194, 186, 143, 32, 133, 8, 51, 43, 22, 94, 143, 33, 139, 22, 63, 172, 119, 58, 215, 120, 129, 247, 198, 232, 194, 246, 170, 66, 206, 238, 21, 211, 197, 83, 23, 15, 124, 3, 244, 166, 202, 25, 105, 66, 164 }, new byte[] { 217, 194, 166, 191, 1, 11, 242, 75, 39, 246, 250, 189, 30, 197, 156, 45, 253, 13, 214, 62, 30, 132, 202, 198, 92, 194, 127, 54, 242, 100, 50, 51, 110, 30, 36, 35, 202, 46, 35, 110, 11, 2, 83, 113, 159, 32, 38, 56, 191, 132, 102, 133, 73, 102, 15, 122, 20, 40, 255, 164, 128, 217, 166, 113, 42, 201, 226, 129, 82, 213, 236, 104, 222, 89, 191, 211, 74, 60, 220, 58, 110, 53, 183, 122, 114, 30, 46, 172, 6, 206, 254, 234, 205, 214, 10, 35, 118, 222, 206, 79, 48, 154, 77, 119, 12, 84, 34, 198, 221, 222, 39, 216, 14, 214, 228, 144, 217, 201, 90, 112, 20, 241, 8, 230, 163, 136, 48, 152 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("4c5d8bb2-b66c-49e7-982b-685ed23d1be8"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 59, 104, 219, 172, 10, 63, 22, 200, 5, 167, 158, 192, 203, 240, 190, 34, 148, 223, 199, 169, 211, 203, 212, 211, 196, 22, 132, 226, 98, 157, 203, 64, 248, 171, 76, 43, 124, 186, 162, 112, 157, 175, 53, 36, 120, 76, 124, 146, 75, 174, 1, 82, 10, 252, 109, 24, 238, 61, 196, 140, 25, 4, 197, 87 }, new byte[] { 45, 87, 72, 40, 143, 155, 71, 209, 176, 233, 87, 158, 153, 171, 249, 118, 184, 51, 29, 240, 238, 249, 247, 144, 4, 1, 189, 66, 243, 196, 27, 203, 160, 108, 32, 106, 53, 208, 153, 18, 54, 76, 67, 226, 181, 47, 18, 214, 166, 95, 214, 168, 213, 30, 80, 182, 232, 163, 111, 144, 146, 248, 185, 9, 111, 20, 29, 206, 217, 50, 16, 217, 188, 43, 100, 163, 0, 255, 5, 228, 209, 179, 208, 222, 66, 149, 57, 14, 12, 183, 226, 33, 217, 228, 62, 46, 224, 90, 128, 233, 154, 198, 192, 181, 179, 57, 121, 132, 227, 255, 47, 122, 217, 189, 93, 12, 251, 15, 48, 69, 114, 196, 102, 116, 199, 91, 23, 209 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("5b670b4c-a8dc-4cca-8d2b-0bb45d69a702"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 226, 203, 230, 146, 72, 153, 108, 250, 91, 116, 140, 33, 224, 212, 136, 245, 224, 166, 155, 242, 119, 68, 69, 144, 102, 129, 126, 237, 199, 186, 98, 113, 166, 14, 237, 246, 112, 3, 119, 152, 89, 91, 102, 48, 94, 155, 50, 0, 66, 148, 61, 176, 14, 179, 113, 177, 30, 17, 21, 80, 4, 86, 38, 254 }, new byte[] { 144, 240, 74, 164, 241, 17, 9, 112, 235, 82, 21, 245, 45, 145, 54, 153, 96, 224, 6, 61, 170, 215, 226, 4, 209, 229, 35, 225, 83, 47, 219, 215, 9, 216, 23, 6, 140, 225, 175, 24, 61, 100, 15, 108, 87, 158, 202, 97, 137, 138, 59, 207, 204, 68, 147, 1, 199, 45, 51, 238, 53, 209, 252, 238, 85, 140, 244, 187, 172, 87, 10, 220, 0, 155, 21, 183, 122, 65, 76, 163, 198, 189, 180, 231, 93, 202, 30, 170, 27, 227, 60, 204, 83, 245, 75, 246, 210, 105, 177, 82, 107, 209, 138, 39, 61, 119, 146, 163, 3, 110, 208, 124, 11, 11, 55, 193, 41, 178, 15, 123, 93, 194, 186, 109, 49, 31, 132, 147 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("5ddbd197-9ac9-42fb-bdfe-dee7dbe35efd"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 251, 157, 233, 147, 4, 252, 146, 220, 219, 146, 22, 49, 214, 229, 130, 242, 104, 176, 214, 54, 151, 113, 235, 171, 151, 159, 7, 243, 168, 69, 45, 75, 157, 220, 34, 28, 133, 10, 11, 95, 74, 105, 173, 92, 179, 202, 212, 49, 170, 199, 17, 213, 193, 209, 227, 213, 137, 157, 89, 48, 74, 69, 188, 53 }, new byte[] { 77, 105, 74, 133, 29, 118, 175, 187, 5, 190, 108, 220, 153, 21, 63, 103, 234, 150, 139, 107, 109, 68, 238, 130, 8, 205, 0, 193, 155, 167, 251, 108, 40, 116, 105, 67, 62, 179, 176, 36, 22, 172, 82, 194, 47, 88, 161, 31, 82, 191, 102, 126, 134, 66, 54, 235, 216, 120, 3, 92, 156, 224, 62, 231, 197, 64, 226, 72, 31, 251, 212, 77, 51, 168, 186, 3, 149, 102, 145, 129, 103, 217, 126, 194, 77, 216, 91, 173, 32, 69, 191, 239, 97, 88, 75, 144, 66, 72, 145, 231, 133, 50, 57, 184, 175, 167, 140, 249, 52, 71, 99, 112, 216, 187, 80, 43, 97, 219, 143, 251, 34, 156, 134, 250, 155, 141, 103, 25 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("666bc14a-4078-4619-85f1-bc63033c556f"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 147, 57, 169, 122, 70, 148, 201, 52, 232, 45, 225, 150, 208, 253, 172, 206, 201, 27, 253, 71, 16, 6, 114, 43, 166, 224, 40, 225, 207, 30, 214, 82, 75, 65, 176, 226, 134, 123, 197, 56, 249, 73, 14, 160, 155, 20, 160, 40, 164, 236, 96, 205, 240, 79, 112, 208, 27, 90, 136, 214, 214, 247, 62, 77 }, new byte[] { 46, 45, 175, 238, 227, 152, 66, 67, 65, 49, 255, 2, 212, 11, 10, 160, 108, 57, 4, 174, 120, 163, 217, 193, 41, 184, 67, 77, 121, 249, 103, 105, 173, 43, 206, 171, 219, 139, 90, 152, 204, 69, 34, 76, 45, 202, 16, 60, 252, 249, 225, 134, 228, 254, 177, 222, 57, 8, 115, 23, 254, 201, 107, 44, 58, 188, 245, 139, 79, 220, 183, 7, 55, 5, 71, 45, 144, 31, 111, 15, 107, 71, 22, 159, 43, 20, 91, 146, 75, 219, 141, 78, 221, 142, 207, 79, 251, 68, 84, 92, 116, 246, 184, 225, 226, 158, 75, 95, 33, 5, 249, 98, 149, 44, 196, 49, 41, 149, 116, 47, 204, 23, 60, 42, 248, 244, 108, 101 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("6d6ad990-1ff2-445b-8496-d766048e25cf"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 194, 168, 113, 142, 103, 137, 238, 219, 117, 233, 82, 90, 98, 38, 138, 85, 205, 218, 109, 83, 75, 87, 77, 200, 11, 79, 142, 222, 90, 77, 56, 68, 40, 148, 250, 250, 194, 33, 230, 249, 89, 121, 180, 250, 223, 156, 185, 29, 93, 193, 12, 214, 1, 58, 69, 55, 238, 47, 50, 106, 123, 183, 37, 224 }, new byte[] { 13, 134, 201, 230, 114, 203, 64, 222, 138, 36, 86, 122, 6, 42, 32, 73, 121, 114, 94, 87, 65, 75, 33, 219, 72, 220, 217, 76, 139, 185, 111, 66, 83, 5, 114, 140, 181, 244, 136, 92, 42, 57, 87, 230, 179, 64, 140, 56, 153, 222, 30, 199, 36, 249, 179, 26, 140, 207, 252, 55, 166, 224, 183, 42, 161, 225, 114, 175, 211, 60, 221, 98, 167, 253, 26, 117, 216, 12, 15, 202, 61, 97, 158, 89, 95, 159, 89, 164, 203, 123, 63, 73, 71, 243, 60, 14, 146, 31, 175, 234, 55, 129, 226, 33, 46, 9, 27, 205, 22, 178, 126, 166, 206, 161, 157, 71, 73, 38, 211, 70, 115, 248, 50, 122, 75, 122, 120, 36 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("84a7c64a-feed-4fb2-8b1e-24e10aa382b2"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 53, 171, 221, 125, 255, 91, 184, 156, 146, 118, 60, 32, 86, 216, 101, 73, 53, 97, 13, 101, 3, 210, 189, 6, 174, 34, 123, 242, 49, 176, 93, 232, 33, 222, 160, 200, 2, 74, 110, 169, 124, 30, 117, 38, 193, 136, 51, 137, 202, 233, 105, 15, 172, 153, 175, 98, 81, 46, 227, 221, 167, 103, 171, 19 }, new byte[] { 6, 211, 238, 236, 191, 149, 64, 99, 63, 141, 112, 121, 165, 40, 39, 46, 108, 164, 67, 107, 130, 88, 148, 152, 246, 13, 53, 207, 160, 119, 229, 8, 118, 62, 78, 253, 94, 16, 185, 44, 235, 20, 21, 129, 129, 126, 159, 95, 162, 208, 170, 12, 214, 194, 201, 174, 166, 251, 49, 82, 60, 239, 39, 79, 12, 15, 9, 203, 58, 175, 146, 168, 171, 174, 139, 184, 205, 121, 252, 112, 89, 5, 19, 216, 72, 241, 168, 218, 146, 89, 199, 82, 114, 13, 72, 98, 64, 57, 109, 118, 91, 167, 105, 7, 143, 99, 44, 141, 2, 104, 147, 44, 5, 6, 29, 90, 41, 12, 146, 255, 91, 87, 204, 143, 132, 218, 23, 134 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("8f744e72-da12-4038-a54e-7512a0ada884"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 22, 178, 34, 182, 22, 218, 127, 227, 35, 126, 167, 119, 212, 149, 184, 55, 157, 56, 216, 49, 41, 36, 159, 101, 177, 141, 239, 184, 1, 11, 172, 29, 22, 83, 64, 188, 132, 7, 115, 95, 252, 114, 235, 206, 189, 209, 250, 19, 113, 248, 193, 171, 175, 243, 131, 131, 232, 230, 233, 172, 241, 34, 60, 220 }, new byte[] { 230, 77, 249, 194, 187, 250, 224, 22, 197, 174, 155, 225, 26, 203, 147, 163, 135, 8, 183, 42, 216, 91, 38, 111, 232, 169, 215, 49, 248, 56, 147, 125, 247, 151, 104, 159, 188, 214, 187, 23, 164, 225, 7, 123, 9, 119, 154, 216, 48, 28, 6, 242, 24, 15, 44, 13, 195, 9, 4, 181, 70, 9, 133, 5, 193, 29, 251, 211, 127, 58, 162, 202, 119, 67, 0, 200, 59, 208, 191, 17, 196, 85, 24, 29, 211, 3, 241, 116, 31, 69, 134, 186, 121, 46, 21, 17, 32, 189, 209, 107, 220, 123, 183, 94, 129, 239, 40, 28, 47, 166, 32, 241, 96, 191, 202, 53, 115, 93, 9, 202, 56, 228, 43, 30, 198, 74, 156, 64 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("96e0097f-ce73-4950-8ee2-89b313581154"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 69, 216, 131, 79, 221, 247, 5, 202, 147, 47, 11, 211, 129, 254, 124, 53, 188, 158, 46, 125, 178, 148, 119, 223, 44, 50, 63, 255, 27, 59, 17, 134, 126, 16, 107, 89, 93, 139, 143, 204, 249, 78, 111, 243, 144, 86, 10, 142, 171, 121, 52, 96, 124, 188, 14, 24, 251, 70, 28, 154, 161, 235, 45, 0 }, new byte[] { 17, 139, 222, 77, 160, 109, 0, 89, 203, 106, 103, 151, 19, 3, 213, 80, 142, 40, 105, 168, 226, 24, 248, 94, 197, 36, 245, 86, 86, 124, 139, 215, 232, 23, 203, 216, 58, 34, 110, 99, 175, 176, 238, 32, 199, 163, 213, 24, 78, 213, 7, 255, 229, 2, 172, 57, 222, 182, 123, 219, 253, 254, 76, 231, 41, 250, 228, 45, 69, 170, 168, 3, 153, 199, 82, 93, 5, 60, 174, 163, 173, 239, 69, 197, 69, 99, 254, 23, 30, 59, 101, 234, 108, 238, 63, 11, 91, 232, 122, 133, 212, 159, 165, 26, 103, 236, 214, 138, 62, 42, 98, 115, 6, 113, 136, 134, 30, 55, 47, 118, 131, 173, 216, 244, 80, 213, 53, 146 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("99c5faa8-d3fe-45b3-a871-86117ef93111"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 62, 252, 205, 134, 96, 105, 82, 54, 205, 125, 15, 246, 60, 234, 175, 124, 251, 191, 42, 15, 56, 121, 218, 244, 134, 98, 237, 4, 170, 170, 232, 1, 8, 99, 172, 112, 194, 7, 220, 70, 99, 108, 49, 65, 27, 148, 160, 153, 28, 233, 200, 119, 23, 144, 92, 224, 211, 174, 116, 243, 134, 83, 246, 20 }, new byte[] { 205, 53, 35, 44, 50, 191, 55, 189, 61, 113, 95, 66, 242, 235, 2, 198, 39, 73, 184, 229, 148, 139, 3, 138, 221, 83, 29, 172, 110, 118, 117, 32, 9, 118, 19, 98, 191, 165, 91, 80, 198, 84, 164, 86, 233, 241, 126, 204, 208, 71, 49, 18, 189, 174, 114, 199, 154, 137, 174, 158, 207, 162, 195, 248, 24, 117, 217, 175, 100, 211, 243, 89, 1, 163, 110, 181, 167, 207, 192, 108, 29, 180, 113, 28, 183, 71, 190, 188, 20, 37, 89, 127, 120, 213, 19, 65, 72, 235, 253, 116, 126, 63, 242, 76, 247, 200, 81, 71, 126, 203, 86, 225, 22, 120, 12, 5, 43, 90, 109, 210, 29, 193, 15, 195, 232, 215, 4, 137 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 120, 219, 171, 206, 52, 6, 138, 239, 191, 174, 85, 32, 196, 89, 168, 35, 36, 132, 219, 1, 10, 252, 64, 207, 48, 111, 232, 177, 244, 22, 107, 20, 107, 175, 99, 206, 188, 179, 124, 3, 174, 69, 137, 230, 134, 200, 81, 235, 245, 52, 115, 43, 50, 195, 153, 115, 250, 123, 1, 63, 84, 116, 166, 143 }, new byte[] { 225, 143, 234, 176, 57, 210, 146, 82, 91, 112, 116, 9, 14, 246, 25, 106, 28, 76, 92, 60, 238, 156, 56, 178, 20, 86, 49, 95, 16, 253, 234, 81, 58, 214, 180, 121, 118, 73, 6, 146, 95, 100, 227, 45, 154, 171, 251, 15, 231, 180, 215, 38, 35, 97, 28, 48, 240, 156, 199, 153, 35, 229, 152, 253, 84, 86, 229, 11, 232, 53, 136, 86, 88, 127, 180, 63, 250, 6, 174, 112, 106, 252, 25, 186, 87, 161, 113, 193, 75, 63, 2, 234, 193, 71, 81, 247, 213, 9, 196, 132, 93, 56, 169, 64, 67, 111, 80, 233, 50, 36, 152, 103, 197, 146, 11, 140, 212, 154, 216, 72, 74, 199, 19, 48, 70, 255, 199, 244 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("c30d316f-9c93-42c9-8e72-0b3efa896192"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 50, 68, 204, 214, 99, 226, 183, 221, 48, 19, 162, 127, 162, 50, 151, 169, 89, 139, 8, 96, 238, 80, 237, 180, 244, 34, 198, 69, 185, 135, 211, 139, 169, 164, 52, 68, 44, 99, 222, 207, 153, 173, 131, 46, 47, 145, 51, 142, 189, 93, 122, 38, 245, 193, 87, 245, 229, 150, 125, 177, 174, 34, 241, 33 }, new byte[] { 214, 38, 118, 71, 51, 137, 218, 90, 239, 53, 98, 3, 95, 241, 161, 62, 138, 199, 32, 84, 81, 182, 41, 1, 127, 115, 204, 82, 144, 98, 90, 247, 101, 177, 70, 224, 159, 49, 114, 109, 25, 25, 194, 73, 50, 250, 65, 34, 240, 175, 52, 45, 176, 69, 40, 202, 140, 172, 26, 255, 46, 78, 100, 27, 19, 253, 160, 24, 113, 212, 76, 201, 90, 154, 36, 19, 105, 9, 245, 117, 241, 81, 85, 227, 117, 101, 46, 79, 39, 81, 74, 197, 208, 193, 250, 109, 207, 148, 111, 75, 178, 250, 151, 170, 177, 244, 207, 174, 6, 157, 0, 111, 253, 203, 23, 131, 103, 219, 45, 207, 233, 176, 179, 51, 96, 148, 5, 108 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("c5eacfa9-ec87-4150-bedc-ca141458b5a3"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 181, 172, 121, 167, 206, 223, 21, 31, 51, 194, 59, 60, 179, 217, 88, 157, 192, 13, 176, 52, 17, 44, 194, 110, 248, 122, 96, 134, 81, 26, 103, 254, 226, 146, 92, 65, 72, 38, 52, 151, 15, 143, 188, 136, 247, 48, 142, 237, 232, 189, 199, 81, 156, 20, 122, 238, 27, 251, 48, 201, 210, 122, 107, 182 }, new byte[] { 82, 218, 79, 123, 148, 129, 120, 109, 103, 25, 4, 29, 124, 148, 39, 29, 123, 12, 254, 165, 19, 175, 42, 28, 189, 175, 16, 67, 108, 99, 41, 127, 223, 190, 222, 241, 234, 217, 190, 162, 95, 200, 121, 106, 65, 76, 29, 77, 196, 42, 37, 82, 15, 14, 166, 226, 157, 86, 158, 115, 169, 39, 140, 133, 98, 126, 52, 172, 204, 147, 31, 24, 76, 122, 125, 245, 36, 45, 226, 149, 95, 156, 168, 237, 78, 236, 79, 25, 18, 93, 60, 229, 73, 184, 114, 174, 161, 144, 151, 157, 255, 131, 44, 226, 22, 130, 220, 107, 164, 139, 42, 77, 166, 228, 89, 17, 169, 63, 190, 104, 50, 247, 144, 16, 158, 124, 102, 212 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("cb235a17-fd24-48cf-ba34-ac5ac698a832"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 56, 57, 166, 193, 164, 66, 12, 191, 131, 82, 28, 85, 144, 187, 175, 130, 33, 44, 160, 186, 94, 6, 188, 192, 28, 232, 47, 4, 104, 173, 123, 215, 1, 181, 191, 238, 127, 127, 78, 185, 184, 68, 248, 90, 153, 29, 220, 63, 159, 118, 29, 49, 14, 27, 1, 128, 101, 188, 33, 202, 59, 2, 101, 132 }, new byte[] { 27, 88, 56, 194, 173, 20, 166, 201, 19, 137, 121, 247, 114, 36, 84, 3, 0, 174, 108, 50, 16, 97, 255, 223, 170, 138, 216, 239, 32, 214, 128, 150, 131, 217, 136, 79, 83, 102, 66, 223, 220, 223, 112, 43, 173, 26, 108, 110, 63, 174, 233, 239, 3, 28, 190, 166, 109, 53, 165, 125, 222, 21, 188, 145, 134, 54, 167, 72, 235, 63, 64, 169, 187, 139, 143, 207, 240, 162, 69, 153, 65, 213, 242, 168, 87, 175, 222, 206, 186, 99, 126, 47, 135, 206, 209, 103, 129, 190, 238, 234, 250, 251, 215, 155, 61, 224, 31, 60, 60, 160, 95, 37, 61, 223, 49, 225, 167, 180, 81, 244, 219, 66, 47, 139, 34, 156, 183, 86 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("d406be20-d364-43c5-84bf-4d3e3be43ae0"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 173, 159, 155, 204, 65, 136, 215, 68, 213, 185, 166, 12, 224, 206, 201, 100, 164, 60, 250, 136, 176, 82, 150, 211, 123, 1, 118, 133, 181, 69, 184, 187, 223, 232, 213, 105, 194, 200, 5, 33, 16, 1, 48, 181, 174, 150, 66, 149, 76, 249, 203, 166, 247, 108, 249, 218, 4, 229, 72, 139, 82, 184, 253, 114 }, new byte[] { 29, 175, 87, 165, 43, 13, 69, 235, 18, 39, 100, 240, 196, 201, 78, 216, 188, 68, 175, 181, 155, 58, 239, 89, 147, 67, 160, 123, 215, 128, 203, 151, 82, 51, 172, 79, 221, 18, 23, 123, 250, 234, 96, 123, 49, 86, 117, 93, 177, 3, 79, 137, 146, 193, 168, 89, 50, 24, 17, 106, 21, 31, 234, 116, 58, 247, 232, 211, 250, 8, 39, 34, 234, 222, 17, 3, 60, 87, 250, 4, 183, 147, 2, 124, 212, 58, 128, 227, 193, 254, 104, 142, 236, 118, 160, 133, 212, 76, 61, 190, 198, 111, 75, 18, 33, 83, 102, 90, 115, 162, 136, 146, 161, 150, 142, 8, 173, 81, 151, 118, 241, 181, 170, 16, 224, 174, 125, 7 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("e798134f-8d1b-41aa-98c1-c8914240366d"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 84, 28, 167, 147, 56, 185, 42, 30, 10, 252, 56, 237, 213, 10, 245, 62, 159, 81, 9, 143, 67, 239, 9, 64, 232, 15, 227, 86, 210, 118, 38, 174, 139, 131, 251, 206, 240, 63, 70, 193, 48, 234, 195, 37, 43, 153, 209, 83, 198, 77, 87, 59, 0, 207, 234, 16, 231, 238, 57, 89, 23, 90, 61, 182 }, new byte[] { 222, 102, 114, 198, 247, 96, 241, 17, 161, 56, 166, 87, 173, 54, 188, 39, 194, 122, 18, 77, 162, 11, 7, 194, 13, 149, 91, 236, 108, 79, 114, 27, 48, 248, 62, 140, 18, 111, 131, 153, 206, 62, 8, 212, 238, 100, 192, 241, 169, 31, 243, 82, 225, 77, 28, 203, 94, 10, 250, 184, 59, 110, 232, 137, 101, 187, 228, 148, 25, 170, 125, 107, 206, 36, 227, 113, 89, 129, 65, 142, 42, 156, 114, 95, 106, 117, 146, 49, 89, 233, 60, 118, 84, 188, 127, 242, 70, 6, 190, 194, 177, 199, 35, 104, 111, 175, 191, 172, 166, 28, 140, 14, 10, 94, 92, 76, 129, 126, 224, 197, 8, 92, 196, 217, 146, 147, 139, 99 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("f0b84747-fbed-43e1-9cd1-ecf2e1bd3cc0"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 82, 134, 192, 153, 43, 162, 46, 101, 75, 160, 156, 119, 61, 179, 142, 129, 123, 148, 153, 30, 240, 245, 96, 204, 145, 239, 90, 238, 242, 66, 131, 232, 32, 187, 164, 81, 73, 11, 132, 27, 193, 85, 42, 48, 70, 116, 148, 208, 91, 230, 233, 170, 12, 229, 229, 127, 24, 101, 30, 140, 169, 211, 67, 22 }, new byte[] { 107, 189, 250, 199, 28, 207, 136, 145, 181, 61, 147, 91, 98, 60, 10, 199, 91, 116, 61, 171, 31, 48, 19, 0, 167, 249, 132, 197, 130, 49, 119, 50, 23, 181, 95, 182, 107, 56, 44, 252, 206, 206, 31, 243, 80, 193, 254, 177, 4, 20, 54, 200, 199, 192, 162, 171, 188, 19, 67, 180, 140, 104, 255, 156, 150, 118, 201, 219, 100, 40, 247, 119, 232, 136, 249, 155, 19, 134, 54, 71, 26, 136, 1, 193, 93, 206, 125, 151, 138, 118, 169, 105, 40, 219, 214, 203, 109, 157, 69, 17, 168, 179, 67, 221, 206, 160, 60, 91, 85, 45, 213, 129, 234, 30, 227, 73, 19, 120, 152, 173, 227, 67, 215, 167, 188, 90, 250, 25 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("f2dbff0f-0ccb-4cc3-91e3-d068431af710"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 225, 64, 213, 8, 182, 122, 187, 27, 188, 155, 176, 254, 153, 104, 210, 243, 115, 224, 117, 3, 106, 133, 41, 181, 138, 97, 170, 131, 212, 54, 236, 139, 242, 14, 21, 60, 70, 92, 225, 247, 163, 100, 92, 12, 62, 205, 223, 36, 55, 118, 177, 133, 55, 156, 184, 38, 81, 198, 0, 187, 201, 118, 105, 72 }, new byte[] { 90, 176, 107, 246, 62, 246, 210, 246, 243, 137, 142, 16, 32, 225, 142, 241, 133, 164, 27, 16, 183, 105, 46, 98, 64, 143, 62, 170, 237, 191, 83, 56, 60, 53, 97, 110, 190, 50, 137, 196, 195, 84, 232, 152, 116, 140, 215, 100, 52, 95, 144, 80, 210, 199, 183, 248, 43, 72, 21, 162, 142, 103, 25, 147, 191, 206, 176, 100, 193, 233, 185, 244, 87, 64, 228, 48, 75, 237, 7, 129, 62, 151, 221, 194, 248, 76, 245, 221, 241, 225, 86, 224, 78, 96, 92, 197, 133, 25, 93, 196, 79, 156, 36, 123, 210, 1, 57, 183, 166, 188, 81, 24, 95, 63, 91, 54, 229, 91, 123, 107, 15, 243, 41, 79, 48, 153, 96, 47 } });
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 21);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 22);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 23);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 24);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 25);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 26);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 27);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 28);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 29);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 30);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 31);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 32);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 33);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 34);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 35);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 36);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 37);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 38);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 39);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 40);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 41);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 42);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 43);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 44);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 45);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 46);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 47);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 48);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 49);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 50);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 51);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 52);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 53);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 54);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 55);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 56);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 57);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 58);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 59);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 60);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 61);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 62);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 63);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 64);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 65);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 66);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 67);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 68);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 69);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 70);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 71);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 72);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 73);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 74);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 75);

            migrationBuilder.DeleteData(
                table: "MBTI_Questions",
                keyColumn: "Id",
                keyValue: 76);

            migrationBuilder.UpdateData(
                table: "Attempts",
                keyColumn: "Id",
                keyValue: new Guid("9b8daa9f-7f8c-41d9-aa34-ba2b1010f4ed"),
                columns: new[] { "CreatedDate", "ExamDate" },
                values: new object[] { new DateTime(2023, 11, 19, 13, 28, 40, 484, DateTimeKind.Utc).AddTicks(515), new DateTime(2023, 11, 20, 13, 28, 40, 484, DateTimeKind.Utc).AddTicks(520) });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("09d2d924-8c18-4e49-bbc4-f67c0204d7af"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 64, 155, 255, 2, 206, 206, 47, 40, 66, 225, 73, 59, 233, 198, 51, 168, 56, 78, 189, 88, 153, 171, 69, 82, 155, 255, 13, 228, 33, 165, 216, 227, 190, 212, 19, 125, 13, 23, 214, 120, 143, 183, 19, 168, 56, 207, 242, 209, 20, 138, 225, 54, 215, 209, 58, 188, 201, 136, 22, 100, 244, 92, 245, 177 }, new byte[] { 17, 159, 182, 15, 241, 250, 232, 151, 178, 66, 2, 197, 26, 155, 218, 43, 119, 84, 146, 211, 90, 20, 246, 210, 230, 120, 247, 179, 2, 146, 57, 227, 65, 36, 85, 64, 67, 136, 190, 2, 128, 143, 24, 108, 48, 141, 163, 190, 91, 178, 153, 6, 52, 188, 226, 86, 247, 79, 166, 96, 97, 78, 62, 20, 65, 4, 150, 103, 172, 217, 223, 136, 93, 40, 6, 116, 242, 141, 232, 203, 95, 85, 24, 14, 247, 9, 2, 53, 242, 18, 175, 234, 65, 82, 41, 141, 252, 40, 189, 30, 81, 238, 169, 110, 151, 135, 241, 167, 64, 254, 156, 35, 182, 130, 71, 90, 93, 223, 215, 126, 114, 172, 78, 150, 125, 215, 206, 194 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("1a022b66-8b1c-461a-be8a-ec2a7b0741e9"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 79, 123, 145, 183, 167, 63, 146, 80, 196, 92, 255, 175, 17, 228, 239, 191, 133, 162, 157, 100, 228, 53, 107, 181, 139, 115, 177, 20, 173, 18, 213, 47, 187, 89, 143, 94, 5, 174, 18, 216, 218, 57, 141, 104, 64, 154, 111, 234, 42, 151, 13, 3, 40, 185, 49, 225, 15, 76, 104, 17, 18, 62, 207, 20 }, new byte[] { 249, 111, 251, 90, 203, 18, 131, 188, 21, 115, 59, 74, 144, 20, 43, 88, 196, 93, 216, 216, 156, 59, 224, 46, 95, 6, 211, 235, 1, 146, 79, 68, 250, 217, 9, 191, 20, 178, 202, 210, 130, 87, 7, 156, 155, 73, 23, 227, 133, 169, 183, 70, 67, 125, 47, 113, 58, 174, 121, 18, 246, 67, 118, 107, 249, 44, 159, 54, 232, 166, 55, 117, 35, 234, 114, 219, 210, 73, 53, 237, 207, 239, 5, 126, 85, 159, 135, 171, 43, 255, 121, 73, 99, 133, 219, 215, 195, 130, 95, 71, 25, 123, 105, 229, 60, 140, 133, 55, 239, 213, 207, 105, 142, 104, 75, 19, 199, 205, 20, 64, 52, 88, 25, 92, 162, 107, 237, 68 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("1eff27be-f2ea-4df7-93a5-33c7ba5e2d98"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 141, 149, 81, 176, 191, 161, 121, 247, 248, 137, 109, 220, 123, 80, 238, 70, 214, 135, 78, 246, 159, 88, 157, 73, 56, 153, 91, 83, 190, 52, 210, 98, 14, 96, 74, 155, 213, 188, 185, 158, 248, 133, 187, 84, 195, 15, 70, 107, 155, 48, 51, 108, 254, 85, 152, 222, 41, 181, 55, 55, 189, 103, 110, 10 }, new byte[] { 45, 116, 233, 17, 96, 212, 83, 154, 7, 189, 207, 74, 166, 54, 181, 27, 123, 211, 145, 61, 92, 204, 19, 222, 54, 175, 22, 54, 44, 117, 186, 38, 14, 33, 233, 15, 133, 33, 19, 29, 17, 33, 6, 48, 79, 232, 8, 197, 77, 155, 43, 33, 31, 200, 26, 72, 132, 221, 175, 15, 75, 48, 243, 88, 4, 157, 244, 160, 29, 215, 79, 89, 160, 186, 112, 233, 31, 83, 146, 4, 85, 53, 100, 48, 218, 238, 75, 133, 175, 254, 188, 227, 10, 112, 76, 168, 14, 131, 61, 125, 160, 124, 222, 26, 204, 40, 91, 101, 202, 14, 200, 177, 200, 191, 107, 10, 21, 7, 99, 201, 133, 180, 6, 9, 79, 227, 67, 74 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("24d15338-310e-4d3d-9e39-86444fc0ddec"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 130, 177, 87, 34, 197, 170, 84, 105, 1, 97, 122, 212, 190, 130, 95, 149, 177, 62, 1, 6, 101, 96, 172, 113, 112, 54, 104, 124, 187, 19, 98, 204, 29, 126, 110, 254, 168, 225, 153, 210, 4, 166, 181, 16, 83, 195, 229, 197, 7, 114, 112, 240, 215, 101, 97, 76, 188, 12, 67, 110, 159, 4, 212, 82 }, new byte[] { 145, 30, 137, 91, 49, 52, 103, 152, 28, 14, 241, 178, 54, 37, 176, 114, 78, 97, 168, 230, 212, 27, 58, 185, 222, 132, 99, 135, 217, 188, 226, 102, 221, 54, 115, 59, 84, 159, 224, 13, 16, 35, 68, 100, 44, 244, 235, 9, 146, 25, 194, 215, 178, 78, 246, 123, 203, 33, 213, 21, 10, 174, 218, 72, 80, 3, 88, 170, 206, 130, 44, 219, 65, 97, 83, 184, 239, 115, 128, 151, 159, 14, 204, 5, 74, 103, 197, 250, 227, 181, 131, 89, 180, 99, 184, 12, 169, 39, 141, 71, 15, 154, 59, 191, 154, 30, 122, 58, 235, 86, 132, 128, 106, 170, 19, 201, 87, 140, 130, 137, 180, 254, 241, 177, 253, 115, 144, 192 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("312f4251-1f9f-4f80-b2ad-968fc339b134"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 202, 161, 207, 60, 7, 131, 17, 219, 203, 202, 30, 25, 229, 155, 47, 201, 140, 98, 147, 120, 219, 235, 164, 184, 2, 48, 188, 208, 239, 10, 171, 26, 160, 150, 0, 21, 56, 185, 112, 24, 229, 249, 75, 219, 28, 243, 40, 62, 224, 215, 3, 151, 176, 81, 30, 64, 2, 128, 51, 249, 198, 83, 196, 165 }, new byte[] { 0, 60, 204, 28, 96, 218, 158, 99, 121, 179, 160, 5, 243, 123, 27, 252, 208, 102, 176, 153, 58, 147, 59, 239, 87, 63, 98, 243, 29, 234, 5, 106, 104, 94, 150, 213, 123, 91, 216, 43, 53, 241, 23, 24, 20, 226, 148, 47, 205, 227, 103, 226, 243, 26, 93, 184, 48, 195, 174, 167, 30, 240, 23, 98, 61, 84, 55, 13, 113, 43, 127, 92, 240, 114, 197, 194, 45, 92, 76, 181, 19, 72, 163, 100, 183, 138, 156, 120, 241, 198, 204, 127, 161, 147, 11, 81, 7, 215, 237, 82, 31, 8, 41, 241, 95, 198, 241, 172, 92, 167, 54, 139, 147, 29, 34, 213, 16, 211, 96, 229, 72, 85, 40, 37, 161, 54, 250, 82 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("324ed66e-e8de-4710-a139-18c50b442945"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 210, 159, 122, 18, 153, 24, 73, 50, 217, 10, 195, 185, 79, 72, 152, 253, 254, 151, 166, 80, 171, 233, 217, 50, 70, 121, 149, 210, 132, 221, 50, 46, 111, 166, 152, 134, 149, 127, 14, 225, 196, 96, 141, 5, 140, 255, 155, 246, 199, 78, 65, 50, 165, 81, 139, 102, 54, 113, 202, 239, 6, 139, 185, 56 }, new byte[] { 123, 166, 104, 89, 213, 76, 56, 199, 165, 241, 246, 241, 114, 36, 49, 68, 94, 186, 251, 26, 229, 42, 13, 31, 236, 211, 57, 3, 255, 57, 47, 3, 211, 213, 200, 81, 174, 37, 158, 120, 101, 147, 60, 246, 228, 97, 97, 40, 248, 81, 198, 105, 110, 30, 109, 7, 133, 176, 30, 97, 109, 253, 7, 2, 38, 195, 159, 225, 13, 240, 34, 106, 13, 1, 108, 92, 9, 116, 54, 184, 190, 235, 126, 225, 172, 10, 6, 91, 107, 73, 93, 227, 45, 112, 110, 123, 177, 191, 159, 163, 19, 97, 140, 137, 206, 188, 203, 77, 147, 177, 73, 110, 39, 89, 190, 96, 98, 15, 70, 186, 42, 110, 200, 99, 158, 206, 246, 151 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("4c5d8bb2-b66c-49e7-982b-685ed23d1be8"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 29, 31, 82, 178, 230, 91, 118, 79, 186, 148, 72, 25, 34, 83, 145, 19, 58, 189, 179, 190, 98, 66, 122, 48, 123, 103, 90, 215, 183, 15, 116, 201, 142, 27, 97, 11, 170, 178, 217, 6, 109, 105, 86, 212, 89, 75, 7, 71, 242, 190, 53, 126, 42, 245, 77, 186, 81, 144, 153, 76, 176, 37, 103, 143 }, new byte[] { 148, 167, 124, 59, 66, 10, 113, 52, 110, 47, 210, 254, 126, 9, 52, 208, 34, 71, 36, 155, 50, 169, 115, 127, 194, 234, 32, 73, 177, 10, 152, 168, 131, 174, 210, 255, 6, 61, 28, 131, 89, 209, 234, 198, 102, 96, 141, 59, 225, 119, 132, 57, 214, 40, 232, 131, 122, 33, 54, 254, 62, 223, 136, 165, 130, 251, 214, 54, 129, 216, 106, 87, 179, 127, 78, 189, 90, 130, 48, 244, 192, 147, 56, 65, 62, 233, 128, 37, 234, 236, 123, 225, 5, 96, 153, 245, 213, 36, 100, 124, 244, 30, 176, 68, 237, 61, 247, 64, 107, 10, 112, 193, 160, 22, 171, 95, 198, 32, 32, 144, 200, 41, 75, 191, 112, 192, 159, 3 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("5b670b4c-a8dc-4cca-8d2b-0bb45d69a702"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 75, 5, 195, 188, 155, 195, 254, 113, 196, 87, 63, 43, 162, 101, 70, 97, 104, 238, 91, 62, 201, 168, 162, 77, 73, 95, 52, 142, 223, 11, 129, 255, 171, 213, 195, 61, 131, 230, 167, 126, 118, 105, 33, 22, 59, 158, 38, 54, 218, 69, 5, 243, 212, 96, 119, 62, 240, 220, 110, 150, 106, 191, 191, 0 }, new byte[] { 40, 0, 139, 213, 42, 184, 204, 221, 89, 61, 65, 47, 98, 54, 39, 191, 194, 249, 138, 207, 223, 48, 16, 218, 80, 173, 103, 136, 192, 97, 88, 3, 69, 200, 83, 122, 179, 242, 238, 58, 221, 88, 230, 1, 90, 216, 50, 70, 187, 211, 248, 227, 210, 237, 170, 189, 252, 74, 157, 38, 114, 194, 31, 26, 27, 232, 191, 0, 216, 165, 59, 99, 78, 254, 39, 74, 138, 220, 70, 150, 96, 144, 149, 92, 138, 107, 238, 105, 195, 191, 172, 43, 234, 88, 217, 147, 227, 215, 243, 57, 84, 133, 193, 156, 240, 81, 250, 127, 94, 75, 48, 220, 187, 129, 126, 239, 154, 166, 146, 254, 254, 112, 115, 62, 251, 161, 91, 48 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("5ddbd197-9ac9-42fb-bdfe-dee7dbe35efd"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 179, 35, 193, 210, 147, 192, 51, 231, 7, 1, 228, 143, 181, 158, 133, 149, 144, 136, 132, 141, 184, 2, 99, 30, 85, 140, 30, 72, 234, 106, 51, 23, 158, 136, 227, 94, 88, 12, 35, 102, 8, 246, 255, 103, 179, 81, 147, 33, 51, 247, 41, 238, 61, 11, 45, 202, 191, 193, 188, 182, 176, 137, 118, 199 }, new byte[] { 149, 115, 9, 231, 36, 128, 125, 134, 3, 87, 1, 98, 70, 133, 234, 213, 208, 53, 52, 5, 162, 116, 36, 162, 96, 220, 93, 27, 173, 243, 163, 111, 221, 8, 205, 162, 217, 228, 13, 249, 130, 234, 46, 184, 202, 232, 200, 26, 10, 12, 24, 122, 192, 77, 75, 196, 188, 162, 254, 23, 167, 133, 188, 172, 113, 46, 96, 179, 123, 246, 63, 122, 143, 234, 63, 126, 115, 22, 102, 106, 64, 214, 197, 73, 104, 41, 196, 12, 240, 13, 214, 150, 126, 63, 152, 66, 10, 207, 230, 6, 207, 38, 55, 2, 216, 209, 135, 45, 42, 174, 181, 131, 54, 40, 26, 199, 10, 203, 66, 116, 96, 132, 24, 101, 235, 174, 124, 99 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("666bc14a-4078-4619-85f1-bc63033c556f"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 164, 49, 238, 58, 212, 170, 141, 137, 254, 1, 46, 207, 212, 109, 81, 39, 148, 113, 179, 55, 179, 243, 33, 61, 175, 80, 99, 107, 206, 246, 37, 24, 173, 130, 165, 172, 77, 251, 194, 167, 137, 162, 98, 252, 76, 64, 8, 17, 5, 47, 224, 176, 62, 198, 213, 249, 102, 15, 73, 25, 29, 76, 185, 79 }, new byte[] { 41, 224, 249, 126, 204, 165, 7, 106, 177, 69, 183, 191, 229, 43, 234, 146, 211, 193, 100, 153, 107, 37, 245, 60, 50, 7, 55, 74, 232, 132, 62, 197, 164, 113, 169, 11, 17, 125, 45, 65, 6, 0, 114, 75, 199, 89, 67, 7, 221, 133, 48, 22, 126, 42, 165, 102, 235, 13, 126, 11, 252, 83, 213, 94, 105, 160, 82, 69, 215, 84, 253, 98, 91, 99, 227, 6, 247, 194, 163, 7, 146, 160, 171, 205, 29, 120, 234, 7, 34, 102, 100, 131, 115, 217, 28, 191, 113, 131, 233, 253, 56, 54, 72, 21, 0, 167, 69, 156, 26, 39, 116, 56, 31, 187, 200, 97, 201, 8, 181, 165, 212, 27, 184, 2, 62, 179, 104, 13 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("6d6ad990-1ff2-445b-8496-d766048e25cf"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 63, 76, 160, 108, 95, 148, 143, 53, 44, 149, 168, 93, 190, 237, 9, 184, 91, 64, 212, 111, 201, 79, 139, 246, 179, 135, 42, 103, 133, 189, 224, 121, 136, 11, 108, 219, 225, 146, 82, 25, 171, 181, 215, 137, 9, 128, 14, 110, 245, 240, 81, 5, 24, 130, 215, 180, 167, 38, 162, 97, 181, 142, 12, 141 }, new byte[] { 77, 143, 101, 94, 18, 84, 246, 19, 192, 248, 78, 86, 184, 17, 103, 215, 227, 164, 43, 189, 147, 162, 211, 80, 246, 235, 126, 252, 219, 97, 82, 98, 154, 157, 205, 208, 120, 18, 215, 90, 60, 9, 64, 102, 196, 111, 178, 154, 143, 155, 167, 2, 176, 197, 34, 35, 197, 117, 50, 147, 28, 180, 134, 99, 122, 102, 155, 146, 46, 6, 195, 155, 219, 80, 44, 81, 140, 70, 53, 6, 72, 183, 102, 213, 221, 134, 110, 153, 16, 79, 22, 119, 102, 247, 31, 70, 242, 93, 15, 150, 115, 189, 48, 227, 159, 167, 34, 92, 94, 75, 130, 210, 216, 61, 5, 216, 151, 238, 196, 57, 236, 203, 161, 252, 240, 195, 205, 245 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("84a7c64a-feed-4fb2-8b1e-24e10aa382b2"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 95, 192, 237, 73, 176, 156, 99, 173, 106, 242, 26, 111, 73, 46, 39, 16, 106, 163, 204, 113, 19, 26, 134, 191, 178, 200, 94, 60, 71, 71, 161, 168, 18, 35, 242, 114, 0, 57, 105, 168, 52, 75, 64, 119, 200, 94, 249, 100, 75, 214, 250, 98, 112, 48, 96, 162, 200, 60, 164, 13, 149, 179, 66, 255 }, new byte[] { 81, 168, 150, 75, 103, 154, 108, 211, 27, 152, 168, 104, 232, 255, 50, 64, 47, 123, 159, 153, 16, 164, 163, 125, 37, 169, 112, 111, 100, 74, 149, 32, 207, 156, 57, 152, 27, 44, 21, 253, 109, 34, 175, 31, 164, 83, 2, 221, 145, 207, 49, 35, 143, 12, 218, 52, 129, 12, 170, 23, 59, 108, 250, 173, 66, 205, 21, 218, 14, 200, 209, 225, 64, 49, 107, 66, 165, 120, 91, 171, 153, 23, 243, 76, 47, 161, 139, 236, 51, 103, 74, 36, 117, 150, 204, 240, 138, 10, 236, 49, 186, 159, 172, 126, 142, 134, 209, 94, 148, 42, 59, 48, 113, 193, 133, 159, 204, 97, 186, 183, 138, 20, 39, 84, 225, 246, 236, 145 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("8f744e72-da12-4038-a54e-7512a0ada884"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 64, 10, 41, 53, 233, 73, 253, 223, 246, 16, 77, 139, 77, 238, 230, 179, 203, 37, 233, 51, 149, 17, 180, 211, 130, 114, 139, 67, 157, 201, 251, 194, 114, 199, 71, 27, 161, 125, 191, 111, 148, 24, 226, 142, 200, 103, 180, 171, 255, 110, 14, 216, 243, 110, 155, 167, 244, 157, 140, 167, 236, 215, 32, 113 }, new byte[] { 76, 47, 234, 16, 63, 200, 86, 212, 253, 202, 196, 220, 104, 151, 173, 43, 159, 197, 133, 69, 5, 212, 247, 28, 79, 215, 233, 22, 159, 168, 160, 228, 177, 47, 254, 20, 232, 234, 169, 183, 253, 18, 17, 105, 98, 9, 158, 74, 245, 122, 220, 56, 173, 229, 220, 42, 55, 195, 235, 255, 65, 152, 137, 89, 163, 71, 110, 95, 107, 251, 72, 119, 226, 170, 55, 232, 105, 240, 148, 46, 197, 178, 219, 72, 197, 123, 173, 114, 98, 127, 147, 195, 209, 234, 107, 254, 190, 75, 149, 5, 5, 26, 215, 90, 100, 90, 131, 33, 216, 212, 97, 254, 175, 78, 169, 62, 99, 209, 154, 121, 218, 223, 97, 247, 91, 238, 84, 107 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("96e0097f-ce73-4950-8ee2-89b313581154"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 227, 201, 90, 236, 115, 248, 181, 190, 55, 96, 19, 139, 171, 222, 209, 123, 232, 101, 111, 168, 23, 208, 199, 110, 71, 115, 33, 121, 202, 195, 185, 222, 137, 206, 141, 122, 18, 148, 49, 82, 129, 19, 53, 120, 196, 205, 82, 201, 200, 12, 172, 170, 6, 200, 34, 5, 252, 166, 37, 40, 1, 6, 66, 46 }, new byte[] { 31, 226, 37, 99, 46, 71, 154, 9, 176, 154, 158, 36, 131, 17, 28, 31, 245, 39, 242, 71, 161, 252, 123, 80, 20, 49, 137, 35, 118, 53, 178, 13, 225, 46, 34, 154, 130, 200, 10, 219, 82, 172, 136, 136, 240, 146, 80, 120, 17, 195, 68, 224, 81, 123, 201, 161, 238, 179, 116, 178, 250, 39, 141, 45, 245, 63, 140, 179, 49, 17, 92, 218, 139, 167, 150, 26, 62, 118, 118, 199, 77, 192, 39, 180, 75, 122, 125, 118, 76, 145, 11, 224, 42, 131, 158, 5, 207, 111, 110, 159, 53, 206, 53, 50, 103, 167, 240, 72, 140, 74, 25, 250, 79, 127, 64, 231, 224, 125, 131, 4, 9, 228, 231, 74, 237, 63, 27, 86 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("99c5faa8-d3fe-45b3-a871-86117ef93111"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 188, 210, 113, 86, 59, 7, 218, 99, 242, 248, 141, 115, 38, 6, 195, 59, 94, 149, 230, 75, 78, 165, 217, 62, 127, 190, 3, 56, 26, 202, 235, 183, 17, 114, 213, 70, 239, 238, 85, 120, 2, 131, 65, 147, 142, 104, 167, 162, 31, 62, 254, 239, 43, 152, 69, 67, 206, 233, 28, 186, 219, 119, 25, 63 }, new byte[] { 95, 13, 55, 26, 207, 222, 113, 12, 164, 204, 225, 40, 180, 195, 30, 175, 16, 179, 150, 191, 77, 99, 249, 145, 219, 195, 87, 78, 57, 177, 100, 227, 202, 168, 44, 89, 183, 23, 106, 62, 55, 204, 249, 246, 57, 35, 104, 188, 156, 34, 36, 158, 61, 176, 114, 254, 108, 136, 250, 170, 151, 55, 151, 123, 92, 74, 36, 240, 98, 56, 58, 50, 202, 96, 222, 160, 119, 30, 150, 110, 51, 158, 121, 237, 27, 168, 19, 176, 152, 171, 191, 46, 89, 185, 169, 239, 112, 101, 135, 99, 132, 14, 213, 42, 22, 40, 174, 57, 3, 218, 126, 138, 172, 135, 206, 32, 195, 151, 23, 97, 25, 45, 192, 223, 112, 115, 142, 43 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("a6be20e2-5927-4cce-bed4-258f919f82e6"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 246, 32, 238, 251, 92, 137, 204, 73, 231, 211, 182, 252, 94, 51, 19, 137, 19, 56, 80, 116, 8, 36, 7, 227, 19, 29, 161, 154, 181, 185, 92, 248, 190, 217, 113, 245, 45, 128, 115, 103, 223, 237, 59, 139, 226, 33, 142, 33, 17, 216, 57, 81, 19, 151, 106, 19, 76, 160, 161, 206, 123, 40, 71, 93 }, new byte[] { 205, 126, 222, 214, 193, 232, 26, 98, 132, 238, 147, 128, 139, 86, 80, 120, 10, 202, 201, 203, 205, 201, 93, 61, 85, 98, 71, 0, 44, 254, 192, 19, 87, 109, 225, 124, 94, 246, 117, 170, 185, 91, 225, 101, 221, 127, 136, 163, 175, 153, 35, 82, 63, 208, 245, 251, 72, 124, 208, 93, 164, 194, 77, 85, 128, 199, 157, 240, 119, 240, 155, 65, 30, 248, 188, 242, 109, 163, 245, 130, 122, 142, 204, 44, 191, 65, 141, 206, 157, 218, 110, 60, 10, 251, 73, 230, 189, 237, 245, 148, 64, 199, 159, 118, 149, 194, 19, 24, 64, 233, 165, 27, 165, 244, 74, 192, 162, 245, 133, 19, 173, 96, 210, 236, 212, 59, 122, 132 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("c30d316f-9c93-42c9-8e72-0b3efa896192"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 37, 16, 19, 163, 156, 29, 198, 145, 192, 188, 99, 50, 160, 208, 31, 252, 86, 255, 196, 133, 219, 56, 45, 99, 2, 82, 224, 211, 80, 199, 147, 236, 16, 197, 167, 104, 48, 223, 32, 247, 120, 248, 63, 175, 38, 35, 44, 62, 90, 228, 57, 200, 15, 160, 130, 123, 169, 91, 167, 98, 42, 137, 21, 25 }, new byte[] { 249, 228, 250, 35, 171, 245, 193, 249, 53, 230, 89, 176, 176, 24, 201, 55, 33, 215, 74, 224, 222, 209, 10, 149, 60, 67, 211, 50, 4, 128, 89, 11, 50, 164, 231, 174, 65, 219, 13, 158, 149, 50, 40, 205, 254, 41, 114, 171, 91, 239, 102, 186, 88, 178, 1, 78, 224, 165, 77, 228, 39, 63, 112, 181, 65, 155, 89, 195, 167, 35, 241, 191, 89, 241, 26, 203, 160, 183, 123, 191, 168, 7, 90, 80, 133, 168, 202, 160, 40, 18, 225, 143, 141, 181, 12, 158, 58, 89, 71, 134, 1, 45, 225, 85, 77, 207, 156, 60, 234, 249, 29, 79, 60, 172, 85, 21, 21, 5, 38, 55, 37, 122, 177, 220, 177, 75, 173, 57 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("c5eacfa9-ec87-4150-bedc-ca141458b5a3"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 91, 105, 99, 253, 93, 163, 158, 113, 7, 184, 162, 199, 178, 118, 253, 100, 26, 207, 84, 178, 102, 166, 225, 92, 194, 220, 64, 7, 71, 251, 6, 184, 239, 245, 95, 201, 229, 33, 14, 208, 86, 102, 168, 95, 2, 1, 200, 66, 134, 97, 147, 239, 105, 64, 153, 205, 181, 134, 20, 165, 99, 102, 37, 70 }, new byte[] { 11, 62, 61, 76, 240, 126, 32, 189, 201, 11, 226, 14, 52, 235, 182, 84, 201, 24, 34, 245, 207, 55, 229, 35, 164, 189, 246, 10, 18, 155, 193, 64, 55, 198, 99, 242, 59, 28, 61, 249, 85, 54, 8, 29, 21, 234, 232, 179, 250, 21, 221, 35, 5, 116, 74, 56, 6, 127, 110, 20, 33, 194, 63, 91, 229, 127, 222, 191, 17, 195, 37, 141, 161, 90, 184, 84, 83, 166, 144, 165, 3, 103, 190, 2, 105, 162, 137, 62, 70, 103, 101, 46, 229, 50, 203, 36, 197, 3, 34, 83, 94, 221, 65, 220, 123, 33, 44, 162, 18, 123, 100, 53, 130, 43, 145, 82, 129, 172, 239, 127, 138, 176, 36, 203, 130, 206, 114, 0 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("cb235a17-fd24-48cf-ba34-ac5ac698a832"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 240, 106, 29, 211, 221, 41, 240, 137, 126, 47, 28, 202, 113, 60, 1, 250, 166, 0, 146, 57, 215, 209, 16, 235, 6, 53, 39, 207, 121, 217, 163, 135, 59, 186, 114, 79, 108, 35, 30, 53, 2, 195, 115, 89, 154, 171, 207, 238, 83, 220, 129, 192, 96, 29, 16, 249, 192, 104, 255, 128, 91, 117, 181, 228 }, new byte[] { 220, 61, 155, 161, 78, 201, 101, 54, 140, 213, 132, 199, 129, 63, 212, 100, 253, 3, 112, 16, 177, 113, 42, 245, 154, 17, 123, 179, 127, 3, 63, 171, 194, 130, 155, 210, 130, 69, 85, 113, 209, 230, 214, 102, 132, 42, 187, 80, 110, 100, 125, 107, 148, 228, 33, 84, 224, 168, 27, 26, 68, 11, 65, 82, 247, 89, 49, 39, 102, 241, 32, 6, 120, 170, 108, 71, 204, 55, 111, 250, 186, 236, 39, 51, 81, 111, 26, 17, 118, 129, 112, 175, 73, 154, 181, 149, 79, 60, 236, 203, 3, 171, 6, 38, 3, 129, 155, 67, 157, 10, 131, 89, 39, 184, 93, 129, 108, 252, 37, 225, 130, 146, 136, 115, 243, 16, 214, 223 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("d406be20-d364-43c5-84bf-4d3e3be43ae0"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 61, 26, 52, 153, 183, 242, 246, 205, 189, 80, 251, 41, 199, 63, 213, 187, 195, 154, 22, 67, 93, 221, 45, 229, 112, 196, 76, 41, 50, 66, 176, 150, 8, 193, 174, 134, 226, 7, 64, 193, 1, 1, 81, 195, 111, 22, 106, 72, 172, 136, 220, 123, 96, 17, 185, 196, 15, 118, 33, 198, 164, 148, 184, 23 }, new byte[] { 112, 187, 31, 49, 28, 92, 140, 39, 127, 31, 135, 17, 232, 32, 203, 225, 198, 125, 168, 21, 120, 11, 135, 42, 100, 193, 144, 64, 79, 62, 170, 50, 142, 35, 146, 255, 31, 53, 102, 78, 117, 104, 71, 22, 163, 200, 233, 68, 231, 131, 221, 215, 81, 101, 154, 231, 182, 29, 145, 141, 235, 106, 52, 215, 130, 249, 129, 168, 243, 184, 38, 234, 143, 31, 23, 1, 248, 65, 198, 47, 70, 59, 171, 241, 131, 84, 189, 46, 170, 157, 40, 75, 144, 226, 95, 10, 200, 100, 102, 93, 227, 122, 250, 205, 63, 3, 32, 147, 234, 204, 66, 144, 235, 95, 3, 90, 94, 33, 52, 176, 171, 178, 208, 95, 89, 6, 33, 122 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("e798134f-8d1b-41aa-98c1-c8914240366d"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 97, 94, 147, 242, 103, 131, 46, 18, 223, 102, 68, 65, 179, 108, 117, 32, 228, 199, 238, 76, 157, 197, 224, 20, 239, 31, 164, 224, 205, 251, 12, 12, 46, 189, 104, 114, 229, 109, 11, 130, 3, 149, 54, 19, 86, 192, 217, 152, 159, 189, 151, 135, 240, 65, 169, 187, 7, 138, 87, 158, 180, 147, 142, 119 }, new byte[] { 216, 86, 8, 149, 199, 91, 65, 173, 87, 190, 94, 13, 21, 88, 240, 82, 43, 178, 35, 13, 65, 113, 249, 159, 29, 150, 127, 117, 68, 74, 171, 57, 147, 185, 196, 103, 230, 116, 171, 46, 244, 42, 26, 212, 224, 127, 252, 105, 103, 145, 239, 179, 132, 123, 194, 80, 141, 42, 17, 227, 119, 51, 27, 101, 127, 141, 100, 76, 111, 83, 222, 66, 118, 5, 215, 196, 150, 181, 217, 41, 242, 235, 7, 197, 46, 9, 0, 88, 195, 217, 138, 3, 118, 110, 142, 227, 172, 92, 67, 24, 252, 141, 76, 83, 227, 226, 191, 28, 170, 111, 9, 8, 161, 108, 12, 15, 15, 126, 80, 111, 195, 4, 189, 64, 250, 88, 56, 180 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("f0b84747-fbed-43e1-9cd1-ecf2e1bd3cc0"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 23, 59, 15, 99, 36, 120, 226, 91, 72, 182, 172, 14, 169, 109, 167, 236, 74, 176, 156, 55, 13, 40, 200, 221, 106, 47, 49, 104, 203, 122, 178, 74, 32, 129, 186, 113, 236, 170, 171, 43, 95, 27, 2, 20, 84, 196, 216, 66, 93, 70, 9, 97, 153, 126, 209, 148, 35, 226, 208, 123, 203, 224, 159, 7 }, new byte[] { 231, 54, 84, 102, 72, 122, 90, 111, 50, 103, 250, 157, 128, 190, 194, 220, 124, 80, 250, 196, 12, 231, 30, 136, 230, 189, 158, 37, 102, 84, 83, 247, 68, 86, 144, 153, 136, 36, 40, 2, 142, 218, 21, 52, 252, 92, 157, 120, 122, 164, 80, 150, 74, 146, 20, 184, 35, 175, 122, 234, 140, 76, 127, 84, 100, 253, 239, 11, 7, 49, 53, 104, 119, 161, 254, 63, 100, 52, 206, 187, 52, 69, 145, 160, 146, 182, 194, 168, 167, 229, 47, 105, 146, 229, 238, 27, 25, 233, 31, 227, 1, 81, 115, 37, 223, 81, 170, 110, 162, 191, 254, 246, 214, 117, 115, 91, 112, 166, 176, 152, 32, 231, 13, 164, 202, 174, 153, 106 } });

            migrationBuilder.UpdateData(
                table: "Users",
                keyColumn: "Id",
                keyValue: new Guid("f2dbff0f-0ccb-4cc3-91e3-d068431af710"),
                columns: new[] { "PasswordHash", "PasswordSalt" },
                values: new object[] { new byte[] { 53, 79, 213, 207, 197, 240, 130, 117, 185, 4, 122, 111, 66, 167, 60, 157, 224, 118, 128, 10, 125, 68, 209, 161, 2, 222, 104, 14, 255, 107, 217, 234, 217, 184, 185, 30, 157, 53, 153, 108, 110, 216, 252, 21, 184, 110, 122, 116, 100, 230, 229, 163, 2, 42, 148, 110, 10, 230, 75, 18, 185, 112, 36, 31 }, new byte[] { 221, 126, 185, 0, 156, 125, 236, 245, 240, 155, 2, 94, 158, 20, 24, 197, 35, 175, 253, 125, 85, 88, 175, 70, 27, 14, 186, 75, 103, 57, 250, 246, 250, 139, 159, 41, 231, 231, 95, 145, 242, 233, 180, 252, 226, 124, 78, 225, 189, 160, 225, 181, 187, 29, 116, 188, 199, 159, 6, 144, 49, 19, 209, 61, 236, 13, 216, 96, 112, 77, 239, 39, 239, 0, 11, 234, 247, 201, 27, 50, 32, 245, 110, 141, 171, 49, 208, 191, 157, 223, 124, 177, 88, 187, 39, 189, 240, 1, 13, 78, 58, 135, 188, 66, 151, 32, 71, 192, 15, 94, 84, 96, 215, 130, 255, 1, 233, 57, 196, 38, 81, 195, 152, 135, 18, 26, 178, 193 } });
        }
    }
}
